In [1]:
# Import dependencies
import pandas as pd
import numpy as np
pd.set_option('max_colwidth', 400)

In [2]:
nba_df = pd.read_csv('../NBA_Demographics.csv')

In [3]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4688 entries, 0 to 4687
Data columns (total 31 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rk      4688 non-null   int64
 1   Player  4688 non-null   object
 2   Yrs     4688 non-null   int64
 3   From    4688 non-null   int64
 4   To      4688 non-null   int64
 5   G       4688 non-null   int64
 6   MP      4395 non-null   float64
 7   FG      4688 non-null   int64
 8   FGA     4688 non-null   int64
 9   3P      3759 non-null   float64
 10  3PA     3759 non-null   float64
 11  FT      4688 non-null   int64
 12  FTA     4688 non-null   int64
 13  ORB     3945 non-null   float64
 14  TRB     4443 non-null   float64
 15  AST     4688 non-null   int64
 16  STL     3761 non-null   float64
 17  BLK     3761 non-null   float64
 18  TOV     3842 non-null   float64
 19  PF      4688 non-null   int64
 20  PTS     4688 non-null   int64
 21  FG%     4659 non-null   float64
 22  3P%     3301 non-null   float64
 23  FT%     4480 non-null   float64
 24  MP.1    4395 non-null   float64
 25  PTS.1   4688 non-null   float64
 26  TRB.1   4443 non-null   float64
 27  AST.1   4688 non-null   float64
 28  Date    4686 non-null   object
 29  City    4659 non-null   object
 30  Region  4688 non-null   object
dtypes: float64(15), int64(12), object(4)
memory usage: 1.1+ MB

In [4]:
#df.rename(columns={"A": "a", "B": "c"})
#df.drop(columns=['B', 'C'])
nba_df = nba_df.drop(columns=['G','MP', 'FG', 'FGA', '3P', '3PA', 'FT', 'FTA', 'ORB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'FG%', '3P%', 'FT%', 'MP.1', 'PTS.1', 'TRB.1', 'AST.1'])

In [5]:
nba_df.head(5)

,Rk,Player,Yrs,From,To,PTS,Date,City,Region
0,1,Michael Ansley,3,1990,1992,1026,"Feb 8, 1967",Birmingham,Alabama
1,2,Keith Askins,9,1991,1999,1852,"Dec 15, 1967",Athens,Alabama
2,3,Carl Bailey,1,1982,1982,2,"Apr 23, 1958",Birmingham,Alabama
3,4,Charles Barkley*,16,1985,2000,23757,"Feb 20, 1963",Leeds,Alabama
4,5,Eric Bledsoe,12,2011,2022,10348,"Dec 9, 1989",Birmingham,Alabama

In [6]:
nba_df = nba_df.rename(columns={"Rk": "Rank", "Yrs": "Years_Played", "From": "Start_Year", "To":"End_Year", "PTS": "Points","Date":"BirthDate"})

In [7]:
nba_df.head(5)

,Rank,Player,Years_Played,Start_Year,End_Year,Points,BirthDate,City,Region
0,1,Michael Ansley,3,1990,1992,1026,"Feb 8, 1967",Birmingham,Alabama
1,2,Keith Askins,9,1991,1999,1852,"Dec 15, 1967",Athens,Alabama
2,3,Carl Bailey,1,1982,1982,2,"Apr 23, 1958",Birmingham,Alabama
3,4,Charles Barkley*,16,1985,2000,23757,"Feb 20, 1963",Leeds,Alabama
4,5,Eric Bledsoe,12,2011,2022,10348,"Dec 9, 1989",Birmingham,Alabama

In [8]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4688 entries, 0 to 4687
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          4688 non-null   int64
 1   Player        4688 non-null   object
 2   Years_Played  4688 non-null   int64
 3   Start_Year    4688 non-null   int64
 4   End_Year      4688 non-null   int64
 5   Points        4688 non-null   int64
 6   BirthDate     4686 non-null   object
 7   City          4659 non-null   object
 8   Region        4688 non-null   object
dtypes: int64(5), object(4)
memory usage: 329.8+ KB

In [9]:
from datetime import datetime as dt
#df['date'] = pd.to_datetime(df['date'])
#campaign_df['launched_date'] = pd.to_datetime(campaign_df['launched_date'], unit='s').dt.strftime('%Y-%m-%d')
nba_df['BirthDate']= pd.to_datetime(nba_df['BirthDate']).dt.strftime('%Y-%m-%d')

In [10]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4688 entries, 0 to 4687
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          4688 non-null   int64
 1   Player        4688 non-null   object
 2   Years_Played  4688 non-null   int64
 3   Start_Year    4688 non-null   int64
 4   End_Year      4688 non-null   int64
 5   Points        4688 non-null   int64
 6   BirthDate     4686 non-null   object
 7   City          4659 non-null   object
 8   Region        4688 non-null   object
dtypes: int64(5), object(4)
memory usage: 329.8+ KB

In [11]:
nba_df = nba_df.dropna()

In [12]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4657 entries, 0 to 4687
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          4657 non-null   int64
 1   Player        4657 non-null   object
 2   Years_Played  4657 non-null   int64
 3   Start_Year    4657 non-null   int64
 4   End_Year      4657 non-null   int64
 5   Points        4657 non-null   int64
 6   BirthDate     4657 non-null   object
 7   City          4657 non-null   object
 8   Region        4657 non-null   object
dtypes: int64(5), object(4)
memory usage: 363.8+ KB

In [13]:
cities_df = pd.read_csv('worldcities.csv')

In [14]:
cities_df.head()

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37732000.0,1392685764
1,Jakarta,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,Jakarta,primary,33756000.0,1360771077
2,Delhi,Delhi,28.6100,77.2300,India,IN,IND,Delhi,admin,32226000.0,1356872604
3,Guangzhou,Guangzhou,23.1300,113.2600,China,CN,CHN,Guangdong,admin,26940000.0,1156237133
4,Mumbai,Mumbai,19.0761,72.8775,India,IN,IND,Mahārāshtra,admin,24973000.0,1356226629
...,...,...,...,...,...,...,...,...,...,...,...
44686,Numto,Numto,63.6667,71.3333,Russia,RU,RUS,Khanty-Mansiyskiy Avtonomnyy Okrug-Yugra,NaN,10.0,1643985006
44687,Nord,Nord,81.7166,-17.8000,Greenland,GL,GRL,NaN,NaN,10.0,1304217709
44688,Timmiarmiut,Timmiarmiut,62.5333,-42.2167,Greenland,GL,GRL,Kujalleq,NaN,10.0,1304206491
44689,San Rafael,San Rafael,-16.7795,-60.6799,Bolivia,BO,BOL,Santa Cruz,NaN,NaN,1068007388
44690,Nordvik,Nordvik,74.0165,111.5100,Russia,RU,RUS,Krasnoyarskiy Kray,NaN,0.0,1643587468

In [15]:
cities_df = cities_df.drop(columns=['city', 'country', 'iso2', 'iso3', 'admin_name', 'capital', 'population', 'id'])

In [16]:
cities_df = cities_df.rename(columns={'city_ascii': 'City'})

In [24]:
cities_df

              City      lat       lng
0            Tokyo  35.6897  139.6922
1          Jakarta  -6.1750  106.8275
2            Delhi  28.6100   77.2300
3        Guangzhou  23.1300  113.2600
4           Mumbai  19.0761   72.8775
...            ...      ...       ...
44686        Numto  63.6667   71.3333
44687         Nord  81.7166  -17.8000
44688  Timmiarmiut  62.5333  -42.2167
44689   San Rafael -16.7795  -60.6799
44690      Nordvik  74.0165  111.5100

[44691 rows x 3 columns]

In [27]:
#df.drop_duplicates(subset=['brand'])
cities_df = cities_df.drop_duplicates()

In [28]:
cities_df

              City      lat       lng
0            Tokyo  35.6897  139.6922
1          Jakarta  -6.1750  106.8275
2            Delhi  28.6100   77.2300
3        Guangzhou  23.1300  113.2600
4           Mumbai  19.0761   72.8775
...            ...      ...       ...
44686        Numto  63.6667   71.3333
44687         Nord  81.7166  -17.8000
44688  Timmiarmiut  62.5333  -42.2167
44689   San Rafael -16.7795  -60.6799
44690      Nordvik  74.0165  111.5100

[44690 rows x 3 columns]

In [29]:
#df1.merge(df2, how='inner', on='a')
nba_merged = nba_df.merge(cities_df, how='left', on='City')

In [31]:
nba_df = nba_merged.drop_duplicates()

In [32]:
nba_df

,Rank,Player,Years_Played,Start_Year,End_Year,Points,BirthDate,City,Region,lat,lng
0,1,Michael Ansley,3,1990,1992,1026,1967-02-08,Birmingham,Alabama,52.4800,-1.9025
1,1,Michael Ansley,3,1990,1992,1026,1967-02-08,Birmingham,Alabama,33.5279,-86.7971
2,1,Michael Ansley,3,1990,1992,1026,1967-02-08,Birmingham,Alabama,42.5446,-83.2166
3,2,Keith Askins,9,1991,1999,1852,1967-12-15,Athens,Alabama,37.9842,23.7281
4,2,Keith Askins,9,1991,1999,1852,1967-12-15,Athens,Alabama,33.9508,-83.3689
...,...,...,...,...,...,...,...,...,...,...,...
10586,12,Admiral Schofield,2,2020,2022,245,1997-03-30,London,United Kingdom,39.8935,-83.4375
10587,1,Hasheem Thabeet,5,2010,2014,483,1987-02-16,Dar es Salaam,United Republic of Tanzania,-6.8161,39.2803
10588,1,Esteban Batista,2,2006,2007,121,1983-09-02,Montevideo,Uruguay,-34.8836,-56.1819
10589,1,Óscar Torres,2,2002,2003,442,1976-12-18,Caracas,Venezuela,10.4806,-66.9036
10590,2,Greivis Vásquez,7,2011,2017,3591,1987-01-16,Caracas,Venezuela,10.4806,-66.9036

In [20]:
#campaign_cleaned.to_csv("Resources/campaign.csv", index=False)
nba_df.to_csv("nba_cleaned.csv", index=False)